Reikimen/ESP-IDF-TEST/esp32_http_pcm_v5/sdkconfig.defaults
# ESP32S3 specific
CONFIG_IDF_TARGET="esp32s3"

# SPIFFS Configuration
# 使用默认分区表（包含SPIFFS）
CONFIG_PARTITION_TABLE_TWO_OTA=y

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=0
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=6

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Increase main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable JSON library
CONFIG_JSMN=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Enable I2S driver
CONFIG_DRIVER_I2S_ENABLE=y

# Enable I2C driver
CONFIG_DRIVER_I2C_ENABLE=y

# Set log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

